23 to binary	Остатък
23:2 = 11.5	    1
11:2 = 5.5	    1
5:2 = 2.5	    1
2:2 = 1	    	    0
1:2 = 0.5	    1
Result:	0b10111

  
 128 to binary	Остатък
128:2 = 64	    0
64:2 = 32	    0
32:2 = 16	    0
16:2 = 8	    0
8:2 = 4	   	    0
4:2 = 2	   	    0
2:2 = 1	   	    0
1:2 = 0.5	    1
Result:	0b10000000

  
  34 tо binary	Остатък
34:2 = 17     	   0
17:2 = 8.5	   1
8:2 = 4	           0
4:2 = 2	           0
2:2 = 1	           0
1:2 = 0.5	   1
Result:	0b100010
	
256 to binary 	Остатък
256:2 = 128	0
128:2 = 64	0
64:2 = 32	0
32:2 = 16	0
16:2 = 8	0
8:2 = 4	        0
4:2 = 2	        0
2:2 = 1	        0
1:2 = 0.5	1
Result:	0b100000000

  
245 to octal	Остатък
245:8 = 30.625
30x8 = 240	    5
30:16 = 3.75
3x8 = 24 	    6
3	            3
Result:	365

  
  64 to octal	Остатък
64:8 = 8	   0
8:8 = 1	           0
1	           1
Result:	  100

  
  128 tо octal	Остатък
128:8 = 16	   0
16:8 = 2	   0
2	           2
Result:	   200
  
  
  166 to octal	Остатък
166:8 = 20.75
20x8 = 160	   6
20:8 = 2.5
2x8 = 16	   4 
2	           2
Result:	    246

  
  312 to hexadecimal 	Остатък
312:16 = 19.5
19x16 = 304	           8
19:16 = 1.1875
1x16 = 16	           3
1	                   1
Result:	  0x138

  
  256 to hexadecimal	Остатък
256:16 = 16	           0
16:16 = 1	           0
1	                   1
Result:	  0x100

  
  123 to hexadecimal	Остатък
123:16 = 7.6875 
7x16 = 112	        11 = B
7	                7
	
Result:	  0x7B

  
  317 to hexadecimal	Остатък
317:16 = 19.8125
19x16 = 304	          13
19:16 = 1.1875
1x16 = 16	           3
1	                   1
Result:	    0x13D

  
  100011 to decimal	1x2(5) +0x2(4) +0x2(3) +0x2(2) +1x2(1) +1x2(0)
1x32 + 0x16 + 0x8 + 0x4 + 1x2 + 1x1
32 + 0 + 0 + 0 + 2 + 1 = 35	Result: 35
  
  
1000000 to decimal	1x2(6) + 0x2(5) + 0x2(4) + 0x2(3) + 0x2(2) + 0x2(1) + 0x2(0)
1x64 + 0x32 + 0x16 + 0x8 + 0x4 +0x2 + 0x1 = 64	Result: 64
  
  
1101001 to decimal	1x2(6) + 1x2(5) + 0x2(4) + 1x2(3) + 0x2(2) + 0x2(1) + 1x2(0)
1x 64 + 1x32 + 0x16 + 1x8 + 0x4 + 0x2 + 1x1
64 + 32 + 0 + 0 + 8 + 0 + 0 +1 = 105
	Result: 105
    
    
1001 to decimal	1x2(3) + 0x2(2) + 0x2(1) + 1x2(0)
1x8 + 0x4 + 0x2 + 1x1
8 +1 = 9    Result: 9

    
    
    16F to Decimal 	1x16(2) + 6x16(1) + Fx16(0) 
1x256 + 6x16 + 15x1
256 + 96 + 15 = 367	Result: 367
  
  
19 to Decimal	1x16(1) + 9x16(0)
1x16 + 9x1
16 + 9 = 25	Result: 25
  
  
4A to Decimal	4x16(1) + Ax16(0)
4x16 + 10x1
64 +10 = 74	Result: 74
  
  
7F to Decimal 	7x16(1) + Fx16(0)
7x16 + 15x1
112 + 15 = 127	Result: 127

